# UNIT 33 데이터 누락 다루기

## 결측치 처리방법

### 1. 결측치 삭제

#### dropna()함수 사용
- dropna(axis = 0) : 결측치를 가진 행들을 삭제
- dropna(axis = 1) : 결측치를 가진 열들을 삭제
- dropna(how = "any") : 어떠한 결측치가 존재하면, 해당되는 행 삭제 <- default : axis = 0
- dropna(how = "all") : 모든 값들이 결측치면, 해당되는 행 삭제 <- default : axis = 0
- dropna(axis = 1, how = "all") : 모든 값들이 결측치이면, 해당되는 열 삭제
- dropna(axis = 1, how = "any"): 어떠한 결측치가 존재하면, 해당되는 열 삭제

In [14]:
import pandas as pd
import numpy as np

alco2009 = pd.read_csv("niaaa-report2009.csv", index_col="State")
s_states = [state for state in alco2009.index if state[0]=='S']+["Samoa"]
drinks = list(alco2009.columns)+["Water"]
nan_alco = alco2009.reindex(s_states, columns = drinks)
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [24]:
# 결측치가 있는 행은 삭제하기 때문에 모든 행이 삭제 됨

nan_alco.dropna(axis=0)

Empty DataFrame
Columns: [Beer, Wine, Spirits, Water]
Index: []

In [19]:
# 결측치가 있는 열은 삭제하기때문에 모든 열이 삭제 됨

nan_alco.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [South Carolina, South Dakota, Samoa]

In [21]:
nan_alco.dropna(how="all") # default(axis=0)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN

In [22]:
nan_alco.dropna(how = 'any')  # default(axis = 0)

Empty DataFrame
Columns: [Beer, Wine, Spirits, Water]
Index: []

In [27]:
nan_alco.dropna(how='all', axis=1)

                Beer  Wine  Spirits
State
South Carolina  1.36  0.24     0.77
South Dakota    1.53  0.22     0.88
Samoa            NaN   NaN      NaN

In [28]:
nan_alco.dropna(how='any', axis=1)

Empty DataFrame
Columns: []
Index: [South Carolina, South Dakota, Samoa]

### 2. 결측치 보정

#### isnull( ): 해당 값이 nan이면 True 반환

In [30]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [32]:
nan_alco.isnull()

                 Beer   Wine  Spirits  Water
State
South Carolina  False  False    False   True
South Dakota    False  False    False   True
Samoa            True   True     True   True

#### notnull( ): 해당 값이 nan이 아니면 True 반환

In [33]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [34]:
nan_alco.notnull()

                 Beer   Wine  Spirits  Water
State
South Carolina   True   True     True  False
South Dakota     True   True     True  False
Samoa           False  False    False  False

#### 정상적인 값의 평균으로 결측치 대체

In [3]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [12]:
sp = nan_alco['Spirits']
print(sp)

print('-------------------------------')

clean = sp.notnull()
print(clean)
sp[-clean]=sp[clean].mean()  # [-clean] = Not연산자와 동일한 의미
nan_alco

State
South Carolina    0.77
South Dakota      0.88
Samoa              NaN
Name: Spirits, dtype: float64
-------------------------------
State
South Carolina     True
South Dakota       True
Samoa             False
Name: Spirits, dtype: bool

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24    0.770    NaN
South Dakota    1.53  0.22    0.880    NaN
Samoa            NaN   NaN    0.825    NaN

#### fillna(val)함수를 이용하여 전체 프레임의 결측치 보정
- 옵션 method를 이용하여 열이나 행을 따라서 마지막 관측치를 앞(method ='ffill')이나 뒤(method='bfill')로 채움
- Inplace = True 파라미터를 지정하지 않으면 fillna()함수는 새로운 데이터 프레임이나 시리즈 반환

In [15]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [16]:
nan_alco.fillna(0)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    0.0
South Dakota    1.53  0.22     0.88    0.0
Samoa           0.00  0.00     0.00    0.0

In [18]:
nan_alco.fillna(1.0)  # fillna(val) <- val값에 따라 결측치 보정

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    1.0
South Dakota    1.53  0.22     0.88    1.0
Samoa           1.00  1.00     1.00    1.0

In [30]:
# NaN값을 앞의 값으로 채우고 싶으면 (method="ffill")
# axis = 1 은 ----> 방향을 가리킴

nan_alco.fillna(method='ffill', axis=1)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77   0.77
South Dakota    1.53  0.22     0.88   0.88
Samoa            NaN   NaN      NaN    NaN

In [31]:
# NaN값을 뒤의 값으로 채우고 싶으면 (method="bfill")
# axis = 0 은 ↓ 방향을 가리킴

nan_alco.fillna(method='ffill', axis=0)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa           1.53  0.22     0.88    NaN

### 값 교체
- replace(val_or_list, new_val) : 특정 값이나 값 리스트를 다른 값이나 값 리스트로 교체

In [32]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [33]:
nan_alco.replace({'Water':np.nan, 'Spirits':np.nan}, 100)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77  100.0
South Dakota    1.53  0.22     0.88  100.0
Samoa            NaN   NaN   100.00  100.0

In [34]:
nan_alco.replace({'Spirits':{np.nan:10}, 'Water':{np.nan:20}})

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77   20.0
South Dakota    1.53  0.22     0.88   20.0
Samoa            NaN   NaN    10.00   20.0

#### combine_first(pegs) : 두 데이터 프레임이나 두 시리즈를 결합
- 기준 데이터 셋에 nan이 있을 경우, 참고하는 인덱스의 new data로 업데이트
- 기준 데이터 셋에 없는 인덱스가 참고 데이터에 있는 경우, 기준 데이터에 새로운 인덱스 삽입

In [35]:
s1 = pd.Series([1,2,3,np.nan], index = ['a','b','c','d'])
s1

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [37]:
s2 = pd.Series([10, 20, 30, 40, 50], index=['a','b','c','d','e'])
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [41]:
# s1이 s2를 참고하여 결합
# 기준 데이터셋(s1)의 nan을 참고 데이터셋(s2)로 업데이트
# 기준 데이터셋(s1)에 없는 인덱스 삽입

s1.combine_first(s2)

a     1.0
b     2.0
c     3.0
d    40.0
e    50.0
dtype: float64

In [43]:
df1 = pd.DataFrame({'a':[np.nan, 2, np.nan, 4], 
                    'b':[5,6,7,8],
                    'c':[9,10,11,12]})
df1

     a  b   c
0  NaN  5   9
1  2.0  6  10
2  NaN  7  11
3  4.0  8  12

In [45]:
df2 = pd.DataFrame({'a':['a', 'b', 'c', 'd'],
                    'd':['e', 'f', 'g', 'h'],
                    'e': ['i', 'j', 'k', 'l']})
df2

   a  d  e
0  a  e  i
1  b  f  j
2  c  g  k
3  d  h  l

In [46]:
df1.combine_first(df2)

   a  b   c  d  e
0  a  5   9  e  i
1  2  6  10  f  j
2  c  7  11  g  k
3  4  8  12  h  l